; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v9 ?v13)
             (pred_6 ?v8 ?v10)
             (pred_3 ?v9 ?v10)
             (pred_5 ?v5 ?v9 )
	     (pred_7 ?v9)
             (pred_10 ?v1)
             (pred_4 ?v8)
             (pred_2 ?v10)
             (pred_9 ?v9)
             (pred_1 ?v8)
             (pred_11 ?v9)
             (pred_8 ))



(:action op_5
:parameters (?v3 ?v6 ?v11 ?v4)
:precondition (and (pred_10 ?v3) (pred_10 ?v6) (pred_4 ?v11) (pred_2 ?v4)
          (pred_12 ?v3 ?v6) (pred_6 ?v11 ?v4)
                   (pred_3 ?v6 ?v4) (pred_7 ?v3) 
                   (pred_9 ?v6) (pred_1 ?v11))
:effect (and  (pred_11 ?v6) (not (pred_9 ?v6))))


(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_10 ?v12)
               (pred_7 ?v3) (pred_12 ?v3 ?v12) (pred_11 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v3))))

(:action op_1
:parameters (?v3 ?v11)
:precondition (and (pred_10 ?v3) (pred_4 ?v11) 
                  (pred_7 ?v3) (pred_5 ?v11 ?v3) (pred_8 ))
:effect (and (pred_1 ?v11)
   (not (pred_5 ?v11 ?v3)) (not (pred_8 ))))


(:action op_3
:parameters (?v3 ?v7 ?v2)
:precondition (and (pred_10 ?v3) (pred_4 ?v7) (pred_4 ?v2)
                  (pred_7 ?v3) (pred_1 ?v2) (pred_5 ?v7 ?v3))
:effect (and (pred_1 ?v7) (pred_5 ?v2 ?v3)
        (not (pred_1 ?v2)) (not (pred_5 ?v7 ?v3))))

(:action op_2
:parameters (?v3 ?v11)
:precondition (and (pred_10 ?v3) (pred_4 ?v11) 
                  (pred_7 ?v3) (pred_1 ?v11))
:effect (and (pred_8 ) (pred_5 ?v11 ?v3) (not (pred_1 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_13 obj_01 obj_17 obj_07 obj_08 obj_19 obj_10 obj_05 obj_21 obj_15 obj_04 obj_16 obj_20 obj_02 obj_09
    obj_03 obj_12
    obj_14 obj_18 obj_11
    )

    (:init
       (pred_8)

       (pred_10 obj_06)
       (pred_10 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_19)
       (pred_10 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_4 obj_14)
       (pred_4 obj_18)
       (pred_4 obj_11)

       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_08 obj_21)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_08)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_15 obj_02)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_15 obj_19)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_16 obj_20)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_16)
       (pred_12 obj_02 obj_09)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_3  obj_15 obj_03)
       (pred_3  obj_17 obj_12)
       (pred_3  obj_04 obj_12)
       (pred_11 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_05)
       (pred_11 obj_21)
       (pred_11 obj_16)
       (pred_11 obj_20)
       (pred_11 obj_02)
       (pred_11 obj_09)

       (pred_6  obj_14 obj_03)
       (pred_6  obj_18 obj_12)
       (pred_6  obj_11 obj_12)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_11 obj_09)
       (pred_7 obj_21)
    )

    (:goal (and
       (pred_5 obj_14 obj_19)
       (pred_5 obj_18 obj_07)
    ))
(:constraints
  (always (not (pred_7 obj_15)))
)
)

; plan
1. (op_4 obj_21 obj_20)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_14)
   deleted: (pred_5 obj_14 obj_20) (pred_8)
   added: (pred_1 obj_14)
   goals met: 0 of 2
3. (op_4 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 2
4. (op_5 obj_02 obj_15 obj_14 obj_03)
   deleted: (pred_9 obj_15)
   added: (pred_11 obj_15)
   goals met: 0 of 2
5. (op_4 obj_02 obj_09)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_09)
   goals met: 0 of 2
6. (op_3 obj_09 obj_18 obj_14)
   deleted: (pred_1 obj_14) (pred_5 obj_18 obj_09)
   added: (pred_1 obj_18) (pred_5 obj_14 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_04 obj_18 obj_12)
   deleted: (pred_9 obj_04)
   added: (pred_11 obj_04)
   goals met: 0 of 2
8. (op_4 obj_09 obj_04)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_04)
   goals met: 0 of 2
9. (op_2 obj_04 obj_18)
   deleted: (pred_1 obj_18)
   added: (pred_8) (pred_5 obj_18 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_09)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_09)
   goals met: 0 of 2
11. (op_1 obj_09 obj_14)
   deleted: (pred_5 obj_14 obj_09) (pred_8)
   added: (pred_1 obj_14)
   goals met: 0 of 2
12. (op_4 obj_09 obj_04)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_04)
   goals met: 0 of 2
13. (op_4 obj_04 obj_10)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_10)
   goals met: 0 of 2
14. (op_4 obj_10 obj_19)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_19)
   goals met: 0 of 2
15. (op_2 obj_19 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_8) (pred_5 obj_14 obj_19)
   goals met: 1 of 2
16. (op_4 obj_19 obj_10)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_10)
   goals met: 1 of 2
17. (op_4 obj_10 obj_04)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_04)
   goals met: 1 of 2
18. (op_1 obj_04 obj_18)
   deleted: (pred_5 obj_18 obj_04) (pred_8)
   added: (pred_1 obj_18)
   goals met: 1 of 2
19. (op_4 obj_04 obj_10)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_10)
   goals met: 1 of 2
20. (op_4 obj_10 obj_19)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_19)
   goals met: 1 of 2
21. (op_4 obj_19 obj_08)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_08)
   goals met: 1 of 2
22. (op_4 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 1 of 2
23. (op_2 obj_07 obj_18)
   deleted: (pred_1 obj_18)
   added: (pred_8) (pred_5 obj_18 obj_07)
   goals met: 2 of 2
